app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'sadfasfsdaf' LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def similar
	id = params[:id]
	@movies = Movie.find_movies_with_director_by_id(id)
	if @movies != nil
	else
		flash[:notice] = "\'#{Movie.find(id).title}\' has no director info"